---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarShapeConstraint.Dispose
source: html/80be3c21-c088-51c7-7d4a-8df7a2554062.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeConstraint.Dispose Method

Releases all resources used by the RebarShapeConstraint

## Syntax (C#)
```csharp
public void Dispose()
```